## Series
A one-dimensional labeled array capable of holding any data type

In [1]:
#import pandas
import pandas as pd
#import numpy
import numpy as np

In [2]:
s = pd.Series(['india','pakistan','china'], index=['a','b','c'])
s

a       india
b    pakistan
c       china
dtype: object

## DataFrame

A two-dimensional labeled data structure with columns of potentially different types

### Creating a Dataframe with dictionary data

In [4]:
#Creating a dictionary 'data' with strings as keys and lists as value
data_from_dic = {
        'Country': ['Belgium',  'India',  'Brazil'],
        'Capital': ['Brussels',  'New Delhi',  'Brasilia'],
        'Population': [11190846, 1303171035, 207847528]
        }
df_from_dic = pd.DataFrame(data_from_dic)
df_from_dic

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

In [13]:
## Dataframe with duplicated entries
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012,2012, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions','Lions',''],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4,4, 0],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12,12, 0]}
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12
8  2012    Lions     4      12
9  2012              0       0

In [25]:
football[football.wins == 0 ]

   year team  wins  losses
9  2012          0       0

In [32]:
#Find duplicated entries
#DataFrame.duplicated(subset=None, keep='first')
football.duplicated(['team','year'], keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9    False
dtype: bool

In [29]:
football[football.duplicated(['team','year'], keep='first')]

   year   team  wins  losses
8  2012  Lions     4      12

In [33]:
# Drop duplicates
#DataFrame.drop_duplicates(subset=None, keep='first', inplace=False)
football.drop_duplicates(['year', 'team'], keep='first')

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12
9  2012              0       0

### Creating a Dataframe with list

In [4]:
data_from_list = [
    ['Belgium',  'India',  'Brazil'],
    ['Brussels',  'New Delhi',  'Brasilia'],
    [11190846, 1303171035, 207847528]
]
df_from_list = pd.DataFrame(data_from_list, columns=['Country',  'Capital',  'Population'], index=[1,2,3])
df_from_list

    Country     Capital Population
1   Belgium       India     Brazil
2  Brussels   New Delhi   Brasilia
3  11190846  1303171035  207847528

## Reading a CSV

In [5]:
car_dataset_url ='https://raw.githubusercontent.com/ankitind/sample_datasets/master/car_ad.csv'
car_ads = pd.read_csv(car_dataset_url, header=0)
car_ads.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9576 entries, 0 to 9575
Data columns (total 10 columns):
car             9576 non-null object
price           9576 non-null float64
body            9576 non-null object
mileage         9576 non-null int64
engV            9142 non-null float64
engType         9576 non-null object
registration    9576 non-null object
year            9576 non-null int64
model           9576 non-null object
drive           9065 non-null object
dtypes: float64(2), int64(2), object(6)
memory usage: 748.2+ KB

### Reading a Dataframe using indexes and loc

In [101]:
print(car_ads['body'][1])
print(car_ads.body[1])
print(car_ads.loc[1, 'body'])
print(car_ads.iloc[1, 2])
print("--")
print(car_ads.ix[1:1, 2:3])

sedan
sedan
sedan
sedan
--
    body
1  sedan

## Slicing  Columns and Rows

### Seleting specific columns by passing them as a list

In [138]:
car_ads[['car', 'year','body']].head(4)

             car  year       body
0           Ford  2010  crossover
1  Mercedes-Benz  2011      sedan
2  Mercedes-Benz  2008      other
3  Mercedes-Benz  2012        van

### Seleting specific rows by doing a boolean operation

In [151]:
car_ads[car_ads.mileage>900][0:3].head(4)

,car,price,body,mileage,engV,engType,registration,year,model,drive
334,Toyota,36000.0,crossover,940,NaN,Other,yes,2009,Land Cruiser 200,NaN
2602,Mercedes-Benz,68700.0,crossover,980,3.0,Diesel,yes,2013,GL 350,full
4572,Kia,7150.0,hatch,920,1.4,Petrol,yes,2008,Ceed,front

In [136]:
#or
car_ads[(car_ads.mileage>500) & (car_ads.price>10000)].head(7)

,car,price,body,mileage,engV,engType,registration,year,model,drive
334,Toyota,36000.0,crossover,940,NaN,Other,yes,2009,Land Cruiser 200,NaN
666,BMW,30500.0,sedan,630,NaN,Petrol,yes,2010,523,rear
667,BMW,29500.0,sedan,850,NaN,Petrol,yes,2011,523,rear
668,Nissan,14500.0,crossover,740,2.0,Petrol,yes,2008,X-Trail,full
1524,Skoda,14900.0,hatch,710,1.8,Petrol,yes,2012,Octavia A5,front
1676,Bentley,117000.0,sedan,830,6.0,Petrol,yes,2011,Flying Spur,full
1889,Volkswagen,20500.0,hatch,800,2.0,Diesel,yes,2013,Golf VII,front

In [ ]:
car_ads.ix[0:20,'body':'engV'].head()

In [157]:
#Slicing by providing list 
car_ads.ix[0:20,['body','engV']].head()

        body  engV
0  crossover   2.5
1      sedan   1.8
2      other   5.5
3        van   1.8
4      vagon   NaN

In [135]:
car_ads.ix[car_ads.mileage>900, 'body':'engV'].head(4)

           body  mileage  engV
334   crossover      940   NaN
2602  crossover      980   3.0
4572      hatch      920   1.4
6857      sedan      999   1.3

### Series vs 1-column Dataframe Slicing

In [161]:
#series  (by providing string)
car_ads['body'].head()

0    crossover
1        sedan
2        other
3          van
4        vagon
Name: body, dtype: object

In [163]:
#1-Column Dataframe (by providing list)
car_ads[['body']].head()

        body
0  crossover
1      sedan
2      other
3        van
4      vagon

In [165]:
#2-Column Dataframe (by providing list)
car_ads[['body', 'price']].head()

        body    price
0  crossover  15500.0
1      sedan  20500.0
2      other  35000.0
3        van  17800.0
4      vagon  33000.0

In [188]:
#2-Column Dataframe (by providing list)
car_ads.loc[1:2,['body', 'price']]

    body    price
1  sedan  20500.0
2  other  35000.0

### Slicing in Reverse order

Slice the row labels 4 to 1 in reverse order. 
To do this for hypothetical row labels 'a' and 'b', you could use a stepsize of -1 like so: df.loc['b':'a':-1].m

In [189]:
car_ads.loc[9:1:-1,['body', 'price']]

        body    price
9      sedan  22700.0
8      sedan  21500.0
7      vagon  10500.0
6      sedan   6500.0
5  crossover  16600.0
4      vagon  33000.0
3        van  17800.0
2      other  35000.0
1      sedan  20500.0

### Filtering with multiple Boolean Operators

In [6]:
car_ads[(car_ads.price > 200000) & (car_ads.year > 2014) & (car_ads.body == 'crossover')]

,car,price,body,mileage,engV,engType,registration,year,model,drive
1611,Bentley,499999.0,crossover,0,6.0,Petrol,yes,2016,Bentayga,full
4134,Bentley,449999.0,crossover,0,6.0,Petrol,yes,2016,Bentayga,full
5074,Mercedes-Benz,222000.0,crossover,0,6.3,Petrol,yes,2016,S 63 AMG,full
7914,Bentley,499999.0,crossover,0,6.0,Petrol,yes,2016,Bentayga,full
8205,Land Rover,285000.0,crossover,0,5.0,Petrol,yes,2016,Range Rover,full

### Apply functions

In [39]:
def capitalfuc(x):
    return x.capitalize() 

car_ads_lower = car_ads['car'].apply(capitalfuc)
car_ads_lower.head(7)
#print(upperfuc("asd"))

0             Ford
1    Mercedes-benz
2    Mercedes-benz
3    Mercedes-benz
4    Mercedes-benz
5           Nissan
6            Honda
Name: car, dtype: object

#### Using Lambda function

In [53]:
car_ads_upper = car_ads['car'].apply(lambda x: x.upper())
car_ads_upper.head(7)
#print(upperfuc("asd"))

0             FORD
1    MERCEDES-BENZ
2    MERCEDES-BENZ
3    MERCEDES-BENZ
4    MERCEDES-BENZ
5           NISSAN
6            HONDA
Name: car, dtype: object

### Seelcting columns based on data types

In [45]:
car_ads_object = car_ads.select_dtypes(include=[object])
car_ads_object.head(7)

             car       body engType registration    model  drive
0           Ford  crossover     Gas          yes     Kuga   full
1  Mercedes-Benz      sedan     Gas          yes  E-Class   rear
2  Mercedes-Benz      other  Petrol          yes   CL 550   rear
3  Mercedes-Benz        van  Diesel          yes    B 180  front
4  Mercedes-Benz      vagon   Other          yes  E-Class    NaN
5         Nissan  crossover  Petrol          yes  X-Trail   full
6          Honda      sedan  Petrol          yes   Accord  front

In [47]:
car_ads_int = car_ads.select_dtypes(include=[int])
car_ads_int.head(7)

   mileage  year
0       68  2010
1      173  2011
2      135  2008
3      162  2012
4       91  2013
5       83  2013
6      199  2003

In [48]:
car_ads_float = car_ads.select_dtypes(include=[float])
car_ads_float.head(7)

     price  engV
0  15500.0   2.5
1  20500.0   1.8
2  35000.0   5.5
3  17800.0   1.8
4  33000.0   NaN
5  16600.0   2.0
6   6500.0   2.0

In [54]:
car_ads_ex_float = car_ads.select_dtypes(exclude=[float])
car_ads_ex_float.head(7)

,car,body,mileage,engType,registration,year,model,drive
0,Ford,crossover,68,Gas,yes,2010,Kuga,full
1,Mercedes-Benz,sedan,173,Gas,yes,2011,E-Class,rear
2,Mercedes-Benz,other,135,Petrol,yes,2008,CL 550,rear
3,Mercedes-Benz,van,162,Diesel,yes,2012,B 180,front
4,Mercedes-Benz,vagon,91,Other,yes,2013,E-Class,NaN
5,Nissan,crossover,83,Petrol,yes,2013,X-Trail,full
6,Honda,sedan,199,Petrol,yes,2003,Accord,front

In [59]:
car_ads_ex_number = car_ads.select_dtypes(exclude=[np.number])
car_ads_ex_number.head(7)

             car       body engType registration    model  drive
0           Ford  crossover     Gas          yes     Kuga   full
1  Mercedes-Benz      sedan     Gas          yes  E-Class   rear
2  Mercedes-Benz      other  Petrol          yes   CL 550   rear
3  Mercedes-Benz        van  Diesel          yes    B 180  front
4  Mercedes-Benz      vagon   Other          yes  E-Class    NaN
5         Nissan  crossover  Petrol          yes  X-Trail   full
6          Honda      sedan  Petrol          yes   Accord  front

## Map Function
The .map() method is used to transform values according to a Python dictionary look-up.

In [78]:
def multiply(x):
    x = x*2
    
car_ads['new'] = map(multiply, car_ads['price'])
car_ads.head()

,car,price,body,mileage,engV,engType,registration,year,model,drive,new
0,Ford,15500.0,crossover,68,2.5,Gas,yes,2010,Kuga,full,<map object at 0x1159764e0>
1,Mercedes-Benz,20500.0,sedan,173,1.8,Gas,yes,2011,E-Class,rear,<map object at 0x1159764e0>
2,Mercedes-Benz,35000.0,other,135,5.5,Petrol,yes,2008,CL 550,rear,<map object at 0x1159764e0>
3,Mercedes-Benz,17800.0,van,162,1.8,Diesel,yes,2012,B 180,front,<map object at 0x1159764e0>
4,Mercedes-Benz,33000.0,vagon,91,NaN,Other,yes,2013,E-Class,NaN,<map object at 0x1159764e0>

In [84]:
car_ads.loc[0:20,['new']]

                            new
0   <map object at 0x1159764e0>
1   <map object at 0x1159764e0>
2   <map object at 0x1159764e0>
3   <map object at 0x1159764e0>
4   <map object at 0x1159764e0>
5   <map object at 0x1159764e0>
6   <map object at 0x1159764e0>
7   <map object at 0x1159764e0>
8   <map object at 0x1159764e0>
9   <map object at 0x1159764e0>
10  <map object at 0x1159764e0>
11  <map object at 0x1159764e0>
12  <map object at 0x1159764e0>
13  <map object at 0x1159764e0>
14  <map object at 0x1159764e0>
15  <map object at 0x1159764e0>
16  <map object at 0x1159764e0>
17  <map object at 0x1159764e0>
18  <map object at 0x1159764e0>
19  <map object at 0x1159764e0>
20  <map object at 0x1159764e0>